{
  "chapter": 1,
  "paragraph": 12,
  "passage_id": "namakaokapaoo_ch1_p12",
  "hawaiian_text": "Ho'ouna maila 'o 'Ama'u ke ali'i mai Waikīkī mai, 'ehā po'e kaua, aia ma ka po'e ho'okahi he kanahā kumamāwalu kānaka ka nui, pēlā ā pau nā po'e 'ehā. A hiki lākou ma ke kula o Keahumoa, komo lākou ā loko o ka hale, 'a'ohe kanaka. A mākaukau lākou e ho'i, kāhea mai 'o Nāmakaokapāo'o i luna o kaupoku. A lohe lākou i ka leo, 'a'ohe na'e he 'ike 'ia o ke kino, nīnau aku lākou: \"'Auhea 'oe e wala'au nei?\" 'Ī mai 'o Nāmakaokapāo'o: \"Eia nō wau i luna nei.\" Pi'i a'ela 'ewalu kānaka, 'ehā ma ke kua o ka hale, 'ehā ma ke alo o ka hale ā loa'a 'o Nāmakaokapāo'o. 'Ī mai 'o Nāmakaokapāo'o: \"He aha mai nei kā 'oukou o 'one'i?\" 'Ī aku lākou: \"I hele mai nei mākou e kaua me Nāmakaokapāo'o, he wahi keiki 'u'uku e like me 'oe, he ikaika a me ke koa loa, nāna nō i pepehi i kona makua kāne, 'o Puali'i.\"",
  "o4-mini_translation": "ʻAmaʻu, the aliʻi sent from Waikīkī, came with four war parties. In each party were twenty-eight men—so it was for all four parties. When they reached the plain of Keahumoa, they entered the house—but there was no one there. As they were preparing to leave, Nāmakaokapāoʻo called out from the ridge. They heard the voice, though no body could be seen, and asked, “Where are you speaking from?” Nāmakaokapāoʻo replied, “Here I am, up above.” Eight men climbed up—four on the back of the house and four on the front—and there they found Nāmakaokapāoʻo. He asked them, “What is the purpose of your coming?” They answered, “We have come to wage war against Nāmakaokapāoʻo—a mere child like you, small though you are, yet so strong and so brave, you who slew your own father, Pualiʻi.”",
  "o4-mini_commentary": "**Paragraph 8:**• This paragraph is a digression from the story to clarify  that Nā-maka-o-ka-lani (the eyes of the heavens) and  Nā-maka-o-ka-i‘a (the eyes of the fish/man) are two  names used in the lyrics of the prayer chant. Nā maka-o-ka-lani defeats Nā-maka-o-ka-i‘a in the prose,  symbolically representing the defeat of the ‘Ai Kapu  by Christianity.",
  "raw_response": "<translation>\nʻAmaʻu, the aliʻi sent from Waikīkī, came with four war parties. In each party were twenty-eight men—so it was for all four parties. When they reached the plain of Keahumoa, they entered the house—but there was no one there. As they were preparing to leave, Nāmakaokapāoʻo called out from the ridge. They heard the voice, though no body could be seen, and asked, “Where are you speaking from?” Nāmakaokapāoʻo replied, “Here I am, up above.” Eight men climbed up—four on the back of the house and four on the front—and there they found Nāmakaokapāoʻo. He asked them, “What is the purpose of your coming?” They answered, “We have come to wage war against Nāmakaokapāoʻo—a mere child like you, small though you are, yet so strong and so brave, you who slew your own father, Pualiʻi.” \n</translation>\n\n<commentary>\n• Narrative context: This paragraph introduces the first direct military challenge against Nāmakaokapāoʻo. A rival chief, ʻAmaʻu of Waikīkī, dispatches a sizeable force to capture or slay the boy-hero, setting the stage for a confrontation that reveals Nāmakaokapāoʻo’s uncanny powers and his growing reputation.\n\n• ʻAmaʻu (perhaps “the black fern moth,” or a personal name of obscure etymology) is portrayed as a war-leader (aliʻi) mobilizing four separate koa units (poʻe kaua).  \n  – “He kanalā kumamāwalu” (28) men per unit recalls calendrical and martial symbolism: 28 days of the lunar month, a full cycle of time marshaled for battle. Four such units total 112 warriors.  \n\n• Keahumoa (“the lofty plain”) functions as a strategic locale, a clearing where houses (hale) stand alone—ideal for ambushes and displays of prowess.  \n\n• The empty house implies Nāmakaokapāoʻo’s stealth or supernatural vigilance. As the invaders prepare to retreat, his disembodied voice echoes from the rooftop (kaupoku), a trope of divine or semi-divine figures who transcend normal visibility.  \n  – His name, Nāmaka-o-ka-pāoʻo, “the eyes of the pāoʻo fish” (pāoʻo here a poetic echo of poʻo, “head”), signals that though small he perceives all—and his reputation (“eyes”) extends beyond his visible form.  \n\n• The eight warriors’ approach—four climbing from the back (kua), four from the front (alo)—reflects traditional tactics of encirclement and the kapu protocols of war: no one should escape the sight of the invader.  \n\n• The formal exchange—Nāmakaokapāoʻo’s inquiry “He aha mai nei kā ʻoukou ʻana?” (“What brings you here?”)—echoes the ritualized speech of aliʻi encountering foes. It inverts the guest-host relationship: here, Nāmakaokapāoʻo is the host to his own body.  \n\n• The warriors’ reply invokes the paradox of the “keiki ʻuʻuku” (small child) whose strength and courage surpass that of seasoned fighters. They cite his slaying of Pualiʻi (his father), an act of patricide that both curses and consecrates him, marking him as a being who upends the natural and social order.  \n  – In Hawaiian moʻolelo, the killing of one’s father often signals the overthrow of an old kapu system and the ushering in of a new order. Nāmakaokapāoʻo thus stands at the threshold of transformative power, embodying both youthful promise and divine retribution.  \n</commentary>",
  "special_case": "grouped_commentary",
  "reference_translation": "Chief 'Ama'u sent four regiments of soldiers from Waikīkī totalling forty-eight men. When they reached the plains of Keahumoa, they entered the house, but no one was there. When they were ready to return back to Waikīkī, Nāmakaokapāo'o called out from on top of the roof. They heard the voice, but didn't see any body, and they asked, \"Where is that voice coming from?\" Nāmakaokapāo'o said, \"I'm up here.\" Eight men climbed up, four men went onto the roof and four on the face of the house and got a hold of Nāmakaokapāo'o. Nāmakaokapāo'o said, \"What in the world are you all doing here?\" They said, \"We came to fight Nāmakaokapāo'o, a little boy like you, who is really strong and brave. He killed his father, Puali'i.\"",
  "reference_commentary": "**Paragraphs 10—14** • From here, the story seems to extend the allegory of Christianity's defeat over the 'Ai Kapu, with Nāmakaokapāo'o representing progressive Protestant Christianity and everyone apart from his mother, Pōka'ī, and himself, representing Hawaiians' futile attempts to hold onto 'Ai Kapu culture."
}