{
  "chapter": 1,
  "paragraph": 11,
  "passage_id": "namakaokapaoo_ch1_p11",
  "hawaiian_text": "A laila, lawe akula ia i kona makuahine e hūnā ma ke ana o Waipouli. A nalo ka makuahine, ho'i maila ia ā ko lākou hale ma Keahumoa, noho ihola. Pi'i a'ela 'o Nāmakaokapāo'o ā luna o kaupoku o ka hale, wehe a'ela i ka mau'u o ke kua a me ke alo, a moe ihola ma waena i luna pono o ke kaupoku.",
  "o4-mini_translation": "Then he took his mother and hid her in the cave of Waipouli. When the mother had vanished, he returned to their house at Keahumoa and lived there. Nāmakaokapā‘ō‘o then climbed up to the ridgepole of the house, loosened his tufts of hair at the back and at the front, and lay down squarely in the very center of the ridge.",
  "o4-mini_commentary": "**Paragraph 8:**• This paragraph is a digression from the story to clarify  that Nā-maka-o-ka-lani (the eyes of the heavens) and  Nā-maka-o-ka-i‘a (the eyes of the fish/man) are two  names used in the lyrics of the prayer chant. Nā maka-o-ka-lani defeats Nā-maka-o-ka-i‘a in the prose,  symbolically representing the defeat of the ‘Ai Kapu  by Christianity.",
  "raw_response": "<translation>\nThen he took his mother and hid her in the cave of Waipouli. When the mother had vanished, he returned to their house at Keahumoa and lived there. Nāmakaokapā‘ō‘o then climbed up to the ridgepole of the house, loosened his tufts of hair at the back and at the front, and lay down squarely in the very center of the ridge.\n</translation>\n\n<commentary>\nThis passage (Chapter 1, Paragraph 11) is excerpted from a broader mythological narrative in which the figure Nāmakaokapā‘ō‘o conceals his mother, returns home, and finally takes his place atop the house’s ridgepole, setting the stage for subsequent events in the story.\n</commentary>",
  "special_case": "grouped_commentary",
  "reference_translation": "Nāmakaokapāo'o then took his mother to hide her in the cave of Waipouli. When his mother was well hidden, he went back to their house in Keahumoa and stayed there. Nāmakaokapāo'o climbed up onto the roof of the house and took apart the grass thatch of the ridge and the face and laid down on the ridge of the roof.",
  "reference_commentary": "**Paragraphs 10—14** • From here, the story seems to extend the allegory of Christianity's defeat over the 'Ai Kapu, with Nāmakaokapāo'o representing progressive Protestant Christianity and everyone apart from his mother, Pōka'ī, and himself, representing Hawaiians' futile attempts to hold onto 'Ai Kapu culture."
}