{
  "chapter": 1,
  "paragraph": 6,
  "passage_id": "namakaokapaoo_ch1_p6",
  "hawaiian_text": "I ia wā, noke aku ana ‘o Nāmakaokapāo‘o i ka  huhuki ā pau kekahi māla ‘uala ā luna o kekahi  māla ‘uala, pēlā nō ka huhuki ‘ana ā pau nā māla  ‘elua ā kū ke āhua o ka lau o ka ‘uala, he kanahā  āhua ka nui o nā māla ‘elua. A laila, ho‘i a‘ela ‘o  Nāmakaokapāo‘o a hō‘ā i ke ahi a ‘ōhinu akula ‘ehā  ‘au o ka ‘uala i luna o kapuahi e ‘ā ana. Iā ia e  ‘ōhinu ana i luna o ke ahi, ho‘i maila kona makua  kāne kōlea ā hiki, nīnau akula i kona makuahine, iā  Pōka‘ī: “‘A‘ole.” ‘Ī aku ‘o Puali‘i: “‘Ae, ‘o ke po‘o  ona a me nā maka ka mea e ‘īna‘i ai ku‘u ‘uala i  kēia lā, no laila, eia kona lā e make ai ia‘u.”",
  "o4-mini_translation": "At that time, Nāmakaokapāoʻ o was hard at work uprooting sweet-potato patches—first one patch, then the other—so thoroughly that nothing remained but piles of leaves. The heap of foliage from the two patches numbered forty in all. Then Nāmakaokapāoʻ o went back to build a fire, and he broiled four sweet-potato vines over the blazing coals until they withered. While he was roasting them, his stepfather, Pualiʻi, arrived and asked his mother, Pōkaʻ ī, for her consent. She answered, “No.” But Pualiʻi replied, “Yes. It is his head and his eyes that will serve as relish for my sweet potatoes today. Therefore, this is the day he shall die for me.”",
  "o4-mini_commentary": "• Destructive labor and agricultural imagery  \n  – The verb noke “to work diligently” combined with huhuki “to pull up/root out” conveys Nāmakaokapāoʻo’s relentless effort to dismantle the ‘uala (sweet-potato) patches. Uprooting the vines signifies more than mere mischief; it symbolizes the removal of both subsistence and lineage-bearing elements from the soil.  \n  – The outcome—“he kanahā āhua ka nui o nā māla ʻelua” (“forty in number”)—uses kanahā (four tens) to punctuate the scale of destruction. In Hawaiian numerology, tens often mark completeness or a cycle; here, forty may allude to an exhaustive end of an old order.\n\n• The four vines and the fire ritual  \n  – The four (‘ehā) vines chosen for roasting represent a deliberate selection. In a traditional context, vines (ʻau) are the propagative “eyes” of the ‘uala; to roast them is to nullify future renewal.  \n  – Fire (ahi) serves both purgative and transformative functions in Hawaiian ritual. By broiling the vines (‘ōhinu akula), Nāmakaokapāoʻo enacts a rite of finality, sealing the fate of the old kapu-bound agricultural practice.\n\n• Arrival and exchange between Pōkaʻ ī and Pualiʻi  \n  – Pualiʻi’s return and his question to Pōkaʻ ī (“‘Aʻole?”) tests her allegiance: will she protect her son or yield to her husband’s demand? Her negative reply affirms maternal resistance to violence.  \n  – Pualiʻi’s response—affirming that Nāmakaokapāoʻo’s head (poʻo) and eyes (maka) shall be the ‘īnaʻi (relish) for his meal—invokes a grim subversion of the ‘Ai Kapu sacrificial system. In that era, the head of an ulua fish often stood in for a human sacrifice on the heiau; Pualiʻi now proposes an actual human head and eyes in place of fishing offerings.\n\n• Name-symbolism and allegory  \n  – Nāmaka-o-ka-pāoʻo (“eyes of the pāoʻo fish”) carries its own semantic weight: his very name suggests vision and foresight. Pualiʻi’s threat to eat his “maka” (eyes) is thus a symbolic attempt to extinguish any insight or future-oriented impulse.  \n  – The conflict dramatizes two temporal poles: Pualiʻi clings to the archaic ‘Ai Kapu order, demanding human sacrifice at the banquet; Nāmakaokapāoʻo, by uprooting and roasting the vines, allegorically pushes toward a new era of agricultural self-sufficiency and the end of ritualized killing.\n\n• Cultural and historical echoes  \n  – The entire scene resonates with the tensions preceding the kapu system’s abolition in 1819. Nāmakaokapāoʻo’s radical tearing out of the ‘uala mirrors the social upheaval that would soon tear down rigid kapu prohibitions.  \n  – Pualiʻi’s invocation of head and eyes as meal garnishes recalls chants and stories where consuming a foe’s head confers mana; here, the threat backfires, exposing the brutality inherent in maintaining the old order.",
  "raw_response": "<translation>\nAt that time, Nāmakaokapāoʻ o was hard at work uprooting sweet-potato patches—first one patch, then the other—so thoroughly that nothing remained but piles of leaves. The heap of foliage from the two patches numbered forty in all. Then Nāmakaokapāoʻ o went back to build a fire, and he broiled four sweet-potato vines over the blazing coals until they withered. While he was roasting them, his stepfather, Pualiʻi, arrived and asked his mother, Pōkaʻ ī, for her consent. She answered, “No.” But Pualiʻi replied, “Yes. It is his head and his eyes that will serve as relish for my sweet potatoes today. Therefore, this is the day he shall die for me.”\n</translation>\n\n<commentary>\n• Destructive labor and agricultural imagery  \n  – The verb noke “to work diligently” combined with huhuki “to pull up/root out” conveys Nāmakaokapāoʻo’s relentless effort to dismantle the ‘uala (sweet-potato) patches. Uprooting the vines signifies more than mere mischief; it symbolizes the removal of both subsistence and lineage-bearing elements from the soil.  \n  – The outcome—“he kanahā āhua ka nui o nā māla ʻelua” (“forty in number”)—uses kanahā (four tens) to punctuate the scale of destruction. In Hawaiian numerology, tens often mark completeness or a cycle; here, forty may allude to an exhaustive end of an old order.\n\n• The four vines and the fire ritual  \n  – The four (‘ehā) vines chosen for roasting represent a deliberate selection. In a traditional context, vines (ʻau) are the propagative “eyes” of the ‘uala; to roast them is to nullify future renewal.  \n  – Fire (ahi) serves both purgative and transformative functions in Hawaiian ritual. By broiling the vines (‘ōhinu akula), Nāmakaokapāoʻo enacts a rite of finality, sealing the fate of the old kapu-bound agricultural practice.\n\n• Arrival and exchange between Pōkaʻ ī and Pualiʻi  \n  – Pualiʻi’s return and his question to Pōkaʻ ī (“‘Aʻole?”) tests her allegiance: will she protect her son or yield to her husband’s demand? Her negative reply affirms maternal resistance to violence.  \n  – Pualiʻi’s response—affirming that Nāmakaokapāoʻo’s head (poʻo) and eyes (maka) shall be the ‘īnaʻi (relish) for his meal—invokes a grim subversion of the ‘Ai Kapu sacrificial system. In that era, the head of an ulua fish often stood in for a human sacrifice on the heiau; Pualiʻi now proposes an actual human head and eyes in place of fishing offerings.\n\n• Name-symbolism and allegory  \n  – Nāmaka-o-ka-pāoʻo (“eyes of the pāoʻo fish”) carries its own semantic weight: his very name suggests vision and foresight. Pualiʻi’s threat to eat his “maka” (eyes) is thus a symbolic attempt to extinguish any insight or future-oriented impulse.  \n  – The conflict dramatizes two temporal poles: Pualiʻi clings to the archaic ‘Ai Kapu order, demanding human sacrifice at the banquet; Nāmakaokapāoʻo, by uprooting and roasting the vines, allegorically pushes toward a new era of agricultural self-sufficiency and the end of ritualized killing.\n\n• Cultural and historical echoes  \n  – The entire scene resonates with the tensions preceding the kapu system’s abolition in 1819. Nāmakaokapāoʻo’s radical tearing out of the ‘uala mirrors the social upheaval that would soon tear down rigid kapu prohibitions.  \n  – Pualiʻi’s invocation of head and eyes as meal garnishes recalls chants and stories where consuming a foe’s head confers mana; here, the threat backfires, exposing the brutality inherent in maintaining the old order.\n</commentary>",
  "reference_translation": "At that time, Nāmakaokapāo‘o was busy tearing  apart the sweet potato patches, yanking them out.  He tore apart both sweet potato patches until  there rose a mound of sweet potato leaves, forty  mounds in all from the two patches. Then  Nāmakaokapāo‘o went back and lit a fire to broil  four sweet potato vines on a fire pit. As he was  broiling the vines, wilting them, his stepfather  came back and reached him and asked   Nāmakaokapāo‘o’s mother, Pōka‘ī, and she said,  “No.” Puali‘i said, “Yes, his head and eyes as food  to go with the sweet potatoes that I’ll eat today.  So, today I will kill him.”",
  "reference_commentary": "**Paragraph 6:**• The numbers referred to in this paragraph are  interesting and likely a riddle to solve, with esoteric  meaning: 2, 4, 40\\. Nā-maka-o-ka-pāo‘o is a child, but  behaves like a mature adult, albeit destructive and  spiteful, but calculating. This has allegorical meaning  and likely relates to wastefulness and the need to  dismantle ‘Ai Kapu practices.  • Pua-li‘i was so enraged by Nā-maka-o-ka-pāo‘o’s  destruction of the sweet potato patches that he  threatened to eat his head (po‘o) and eyes (nā maka)  with sweet potato in place of ulua fish. The head of  the ulua or of a person likely represents the sweet  potato tuber and the eyes likely represent the sweet  potato vine cutting (maka) that is used to replant and  perpetuate the crop, symbolically, the people of the  land. This also explains the meaning of ʻmaka’ in the  name, Nā-maka-o-ka-pāo‘o, with ʻpāo‘o’ being used  as a poetic reference to ʻpo‘o’ (head).  – Ulua was used as a substitute for human sacrifice  on the heiau in the ‘Ai Kapu culture (footnote: Pukui & Elbert (1986:369) *ulua*: “This fish was substituted for human sacrifices when the latter were not available , probably because of word magic and the meaning of *ulua 2* \\[to grow/increase; to be possessed by a god\\]. Since an *ulua* replaces a man, *ulua* also means “man, sweetheart,” especially in love songs.”). In this case,  Pua-li‘i threatens to eat the human head and eyes  of Nā-maka-o-ka-pāo‘o in place of the ulua: the  opposite of normal ‘Ai Kapu custom. This appears  to allude to Pua-li‘i’s holding on to the ‘Ai Kapu  customs, going back in time allegorically, rather  than forward in time, where humans are no longer  sacrificed in the Western culture. Nā-maka-o-ka pāo‘o, on the other hand, represents going forward in time, a time of progressive thinking and   abandonment of the ‘Ai Kapu;"
}