{
  "chapter": 1,
  "paragraph": 14,
  "passage_id": "namakaokapaoo_ch1_p14",
  "hawaiian_text": "A lohe 'o 'Ama'u, ho'omākaukau ihola ia i kona mau wa'a kaua he 'umi kumamāwalu, a holo akula i lalo o 'Ewa e kaua me Nāmakaokapāo'o. A hiki 'o 'Ama'u me kona po'e kānaka ma 'Ewa, e noke mai ana 'o Nāmakaokapāo'o i ka luku ā pau loa, 'a'ohe kanaka koe, a make ihola 'o 'Ama'u. Puni a'ela 'o O'ahu nei iā Nāmakaokapāo'o, a laila, ki'i akula ia i kona makuahine a ho'onoho ihola i luna o ka 'āina O'ahu nei.",
  "o4-mini_translation": "Then ‘Ama‘u heard of it, and he completely equipped himself with eighteen war canoes. He sailed down from ‘Ewa to do battle with Nāmakaokapāo‘o. When ‘Ama‘u and his people arrived at ‘Ewa, Nāmakaokapāo‘o rushed down in full onslaught, laid waste so utterly that not a single person was left alive, and ‘Ama‘u himself was slain. Nāmakaokapāo‘o then surrounded all of O‘ahu, and afterwards he climbed up to his mother and had himself firmly installed over the land of O‘ahu.",
  "o4-mini_commentary": "**Paragraph 8:**• This paragraph is a digression from the story to clarify  that Nā-maka-o-ka-lani (the eyes of the heavens) and  Nā-maka-o-ka-i‘a (the eyes of the fish/man) are two  names used in the lyrics of the prayer chant. Nā maka-o-ka-lani defeats Nā-maka-o-ka-i‘a in the prose,  symbolically representing the defeat of the ‘Ai Kapu  by Christianity.",
  "raw_response": "<translation>\nThen ‘Ama‘u heard of it, and he completely equipped himself with eighteen war canoes. He sailed down from ‘Ewa to do battle with Nāmakaokapāo‘o. When ‘Ama‘u and his people arrived at ‘Ewa, Nāmakaokapāo‘o rushed down in full onslaught, laid waste so utterly that not a single person was left alive, and ‘Ama‘u himself was slain. Nāmakaokapāo‘o then surrounded all of O‘ahu, and afterwards he climbed up to his mother and had himself firmly installed over the land of O‘ahu.\n</translation>\n\n<commentary>\nParagraph 14 marks the culmination of Nāmakaokapāo‘o’s early campaigns as he defeats the war chief ‘Ama‘u, conquers the entire island of O‘ahu, and establishes his rule via his maternal line.\n\n• Introduction of ‘Ama‘u  \n  – Name etymology: “‘Ama‘u” may invoke the image of the land snail (“‘ama‘u”), suggesting a persistent, creeping force. The root “‘ama” (to cover, to soil) could also imply one who claims or covers the land.  \n  – As a rival chief, he embodies the old order that must be overturned by the young hero.\n\n• Mobilization of War Canoes (wa‘a kaua)  \n  – ho‘omākaukau ihola ia i kona mau wa‘a kaua he ‘umi kumamāwalu: “he completely prepared eighteen war canoes.”  \n  – The use of “ihola” (“completely”) both here and later in describing ‘Ama‘u’s destruction creates a poetic parallel.  \n  – Eighteen canoes may carry symbolic weight, perhaps alluding to genealogical lines or the full muster of a chief’s martial resources in the ‘Ai Kapu era.\n\n• Geographic and Strategic Setting: ‘Ewa  \n  – “holo akula i lalo o ‘Ewa”: sailing down from the highlands of ‘Ewa, the southwestern district of O‘ahu, historically a power center under the Ewa ali‘i.  \n  – By attacking in this region, ‘Ama‘u directly challenges Nāmakaokapāo‘o on his home turf.\n\n• Nāmakaokapāo‘o’s Counterattack (noke mai)  \n  – “e noke mai ana ‘o Nāmakaokapāo‘o”: “Nāmakaokapāo‘o charges down,” using noke, a verb of sudden, headlong movement—like a storm or predator.  \n  – “luku ā pau loa” and “‘a‘ohe kanaka koe”: “utter annihilation” and “not a single person remains,” employing pau loa to stress totality, a concept familiar in ritual destruction and renewal.\n\n• Destruction of ‘Ama‘u  \n  – “a make ihola ‘o ‘Ama‘u”: “‘Ama‘u was completely slain.” The echo of ihola underlines the thoroughness of his downfall.  \n  – Allegorically, the hero’s slaying of ‘Ama‘u represents the overthrow of entrenched powers and the righting of genealogical imbalance.\n\n• Conquest and Envelopment of O‘ahu (puni a‘ela)  \n  – “Puni a‘ela ‘o O‘ahu nei iā Nāmakaokapāo‘o”: “O‘ahu was wholly encircled and seized by Nāmakaokapāo‘o.” This formulaic phrase is often found in war chants to denote absolute subjugation.  \n  – Conquest through puni evokes both military encirclement and the ritual surround-and-cleanse practices of the ‘Ai Kapu heiau.\n\n• Installation via the Maternal Line  \n  – “ki‘i akula ia i kona makuahine”: “he climbed up to his mother.” In Hawaiian chiefly praxis, the mother’s rank is as important as the father’s; maternal endorsement confers sacred legitimacy.  \n  – “ho‘onoho ihola i luna o ka ‘āina O‘ahu nei”: “he had himself firmly installed over the land of O‘ahu.” The repeated ihola underscores that his installation is as absolute as his victory.\n\n• Allegorical and Cultural Interpretation  \n  – Nāmakaokapāo‘o’s triumph allegorizes the consolidation of ali‘i power and the emergence of a centralized rulership from the chaos of inter-chief warfare.  \n  – His ascent via Pōka‘ī, the mother, reaffirms the balance of male martial prowess and female genealogical authority central to pre-contact Hawaiian governance.\n</commentary>",
  "special_case": "grouped_commentary",
  "reference_translation": "When 'Ama'u heard about it, he prepared eighteen of his war canoes and went over to 'Ewa to make war with Nāmakaokapāo'o. When 'Ama'u reached 'Ewa with his men, Nāmakaokapāo'o went to work killing them all sparing no one, and that is how 'Ama'u died. All of O'ahu fell to Nāmakaokapāo'o. Then he went and got his mother and set her up as ruler over all of O'ahu.",
  "reference_commentary": "**Paragraphs 10—14** • From here, the story seems to extend the allegory of Christianity's defeat over the 'Ai Kapu, with Nāmakaokapāo'o representing progressive Protestant Christianity and everyone apart from his mother, Pōka'ī, and himself, representing Hawaiians' futile attempts to hold onto 'Ai Kapu culture."
}