{
  "chapter": 1,
  "paragraph": 4,
  "passage_id": "namakaokapaoo_ch1_p4",
  "hawaiian_text": "Noho ihola i laila, mahi ‘ai, ‘elua āna mau māla  ‘uala lō‘ihi e waiho nei ā hiki i kēia lā, a ua kapa ‘ia  ka inoa o ia mau māla, ‘o Nāmakaokapāo‘o ā hiki i  kēia lā. A o‘o ka ‘uala, ‘ōlelo ‘o Puali‘i i kāna ‘ōlelo   ho‘ohiki, “Aia ā kālua ke po‘o o ka ulua me ka ‘uala,  a ‘ai ‘o Puali‘i, a laila, noa, ‘ai kāna wahine, Pōka‘ī a  me nā mea ‘ē a‘e. No laila, iho akula ‘o Puali‘i i kai  o Honouliuli e lawai‘a i i‘a ‘ai pū me ka ‘uala.",
  "o4-mini_translation": "They dwelt there long ago, cultivating food, and two of his extensive sweet potato gardens remain even to this day. Those gardens were called Nāmakaokapāo‘o until now. When the sweet potatoes were thoroughly roasted, Puali‘i spoke his solemn vow (ʻōlelo hoʻohiki): “When the head of the ulua is cooked along with the sweet potatoes, Puali‘i alone shall eat; afterward, the restriction shall be lifted (noa), and his wife, Pōka‘i, and the others may eat.” Then Puali‘i went down to the sea at Honouliuli to fish, that the catch might be eaten together with the sweet potatoes.",
  "o4-mini_commentary": "1. Cultural and Historical Context  \n  • Land and Food Cultivation: The passage reflects the ancient Hawaiian practice of settling (noho) in a fertile place and developing multiple māla (gardens) for staple crops like ʻuala (sweet potato). ʻUala was a key introduction crop, prized for its storage and nutritional value.  \n  • Place-Naming (Inoa ʻĀina): The naming of the gardens as Nāmakaokapāo‘o demonstrates how Hawaiians memorialized events, persons, or natural features by bestowing names that endure in oral and geographical memory. This practice anchors genealogy and history in the landscape.  \n  • ʻŌlelo Hoʻohiki (Vow-Speech): Puali‘i’s declaration is an example of a formal vow, establishing a period of tapu (restriction). Only after the fulfilled condition—cooking the ulua head with the sweet potatoes—could food be shared (noa) with others. Such vows reinforced chiefly authority, regulated communal resources, and integrated ritual with daily life.  \n  • Noa and Tapu: The sequence “eat—then noa—others eat” highlights the interplay of tapu (sacred restriction) and noa (lifting of restriction). This reflects a pervasive organizing principle in Hawaiian society, governing diet, social hierarchy, and spiritual purity.  \n  • Fishing at Honouliuli: The descent “iho akula” to the seashore for lawaiʻa (fishing) illustrates the āina‐kanaka (land‐people) relationship, where marine and agricultural resources were managed in concert. Honouliuli remains a known locale on Oʻahu, linking the narrative to real geography.\n\n2. Linguistic Features  \n  • ʻIhola: An archaic marker indicating remote past (“long ago, at a time gone by”), often used in moʻolelo (traditional narratives).  \n  • Mahi ʻAi vs. Mahi ʻĀina: “Mahi ʻai” here means to cultivate food generally, emphasizing subsistence.  \n  • ʻUala Lōʻihi: “Long sweet potatoes,” possibly referring to a prized variety or simply emphasizing abundance.  \n  • ʻOʻo ka ʻuala: ʻOʻo can mean “ripe,” “ready,” or “cooked through.” Contextually it signals that the tubers are done and suitable for the vow’s condition.  \n  • ʻŌlelo Hoʻohiki: A specialized register—formal, almost juridical speech—marking a promise or oath with social and spiritual force.  \n  • Noa: A technical term meaning “free,” “common,” or “lifted from restriction.” Here it marks the transition from tapu food (for the chief alone) to communal sharing.  \n  • Iho akula: “Then he descended,” with akula adding emphasis to the action’s immediacy.  \n  • E lawaiʻa: The infinitive verbal phrase “to fish,” showing purpose (“in order to fish… to eat”).\n\n3. Historical Significance  \n  • The account preserves an origin story for a place-name still recognized in oral tradition and perhaps in land‐survey records.  \n  • It illustrates the integration of agriculture and fishing in Hawaiian subsistence systems, under the authority of aliʻi (chiefs) like Puali‘i.  \n  • The episode exemplifies how chiefly vows regulated resource use and reinforced status, while ultimately redistributing food to the community once ritual conditions were met.  \n  • Linguistically, the text offers snapshots of archaic forms and ritual language, valuable for reconstructing Old Hawaiian syntax and ceremonial registers.\n\nOverall, this passage weaves together genealogy, place‐naming, ritual vocabulary, and subsistence practices, providing a rich window into precontact Hawaiian lifeways and the ways in which land, speech, and social order were inseparable.",
  "raw_response": "<translation>\nThey dwelt there long ago, cultivating food, and two of his extensive sweet potato gardens remain even to this day. Those gardens were called Nāmakaokapāo‘o until now. When the sweet potatoes were thoroughly roasted, Puali‘i spoke his solemn vow (ʻōlelo hoʻohiki): “When the head of the ulua is cooked along with the sweet potatoes, Puali‘i alone shall eat; afterward, the restriction shall be lifted (noa), and his wife, Pōka‘i, and the others may eat.” Then Puali‘i went down to the sea at Honouliuli to fish, that the catch might be eaten together with the sweet potatoes.\n</translation>\n\n<commentary>\n1. Cultural and Historical Context  \n  • Land and Food Cultivation: The passage reflects the ancient Hawaiian practice of settling (noho) in a fertile place and developing multiple māla (gardens) for staple crops like ʻuala (sweet potato). ʻUala was a key introduction crop, prized for its storage and nutritional value.  \n  • Place-Naming (Inoa ʻĀina): The naming of the gardens as Nāmakaokapāo‘o demonstrates how Hawaiians memorialized events, persons, or natural features by bestowing names that endure in oral and geographical memory. This practice anchors genealogy and history in the landscape.  \n  • ʻŌlelo Hoʻohiki (Vow-Speech): Puali‘i’s declaration is an example of a formal vow, establishing a period of tapu (restriction). Only after the fulfilled condition—cooking the ulua head with the sweet potatoes—could food be shared (noa) with others. Such vows reinforced chiefly authority, regulated communal resources, and integrated ritual with daily life.  \n  • Noa and Tapu: The sequence “eat—then noa—others eat” highlights the interplay of tapu (sacred restriction) and noa (lifting of restriction). This reflects a pervasive organizing principle in Hawaiian society, governing diet, social hierarchy, and spiritual purity.  \n  • Fishing at Honouliuli: The descent “iho akula” to the seashore for lawaiʻa (fishing) illustrates the āina‐kanaka (land‐people) relationship, where marine and agricultural resources were managed in concert. Honouliuli remains a known locale on Oʻahu, linking the narrative to real geography.\n\n2. Linguistic Features  \n  • ʻIhola: An archaic marker indicating remote past (“long ago, at a time gone by”), often used in moʻolelo (traditional narratives).  \n  • Mahi ʻAi vs. Mahi ʻĀina: “Mahi ʻai” here means to cultivate food generally, emphasizing subsistence.  \n  • ʻUala Lōʻihi: “Long sweet potatoes,” possibly referring to a prized variety or simply emphasizing abundance.  \n  • ʻOʻo ka ʻuala: ʻOʻo can mean “ripe,” “ready,” or “cooked through.” Contextually it signals that the tubers are done and suitable for the vow’s condition.  \n  • ʻŌlelo Hoʻohiki: A specialized register—formal, almost juridical speech—marking a promise or oath with social and spiritual force.  \n  • Noa: A technical term meaning “free,” “common,” or “lifted from restriction.” Here it marks the transition from tapu food (for the chief alone) to communal sharing.  \n  • Iho akula: “Then he descended,” with akula adding emphasis to the action’s immediacy.  \n  • E lawaiʻa: The infinitive verbal phrase “to fish,” showing purpose (“in order to fish… to eat”).\n\n3. Historical Significance  \n  • The account preserves an origin story for a place-name still recognized in oral tradition and perhaps in land‐survey records.  \n  • It illustrates the integration of agriculture and fishing in Hawaiian subsistence systems, under the authority of aliʻi (chiefs) like Puali‘i.  \n  • The episode exemplifies how chiefly vows regulated resource use and reinforced status, while ultimately redistributing food to the community once ritual conditions were met.  \n  • Linguistically, the text offers snapshots of archaic forms and ritual language, valuable for reconstructing Old Hawaiian syntax and ceremonial registers.\n\nOverall, this passage weaves together genealogy, place‐naming, ritual vocabulary, and subsistence practices, providing a rich window into precontact Hawaiian lifeways and the ways in which land, speech, and social order were inseparable.",
  "reference_translation": "They lived there and farmed, and Puali‘i had two  long sweet potato patches that remain until today,  and the patches were given the name,   Nāmakaokapāo‘o until today. When the sweet  potatoes were mature, Puali‘i said made a  promise, saying, “I’ll cook the head of an ulua fish  in the imu along with some sweet potatoes. When  Puali‘i eats, then the food will be made free for his  woman, Pōka‘ī, and anyone else.” So, Puali‘i went  down to the shore of Honouliuli to fish for a catch  to eat with sweet potatoes.",
  "reference_commentary": "**Paragraph 4:**• Pua-li‘i is a farmer with 2 long sweet potato patches  that lasted until the publication of this story. The  name of this sweet potato garden was known as *Nā maka-o-ka-pāo‘o*, the name of Pō-ka-‘ī’s son, and  victorious hero of the story;  • When the sweet potatoes were ready for harvest,  Pua-li‘i said that when he eats ulua fish with sweet  potatoes, cooked in the imu. The food would then be  made free for others, particularly Pō-ka-‘ī and Nā maka-o-ka-pāo‘o after he eats.  – The emphasis on Pua-li‘i, a male and head of the  family, eating, with his woman and child being  allowed to eat separately after he was done, is a  custom of ‘Ai Kapu culture;  • Having announced the eating routine/schedule, Pua li‘i then went to Hono-uliuli (dark bay) to fish for  ulua.  – The choice of ulua to eat with the ‘uala (sweet  potato) is likely due to the similarity in the   pronunciation of the two words, signifying ʻwhat is  above, so below,’ an old and recurring esoteric  feature of Hawaiian prosidy and culture, with a  lesson that there should always be balance in life  and in human practices (above-below; left-right;  male-female). This is the essence of ʻpono’;"
}