{
  "chapter": 1,
  "paragraph": 10,
  "passage_id": "namakaokapaoo_ch1_p10",
  "hawaiian_text": "A make ‘o Puali‘i, ho‘i akula ‘o   Nāmakaokapāo‘o ā hiki i kona makuahine, iā  Pōka‘ī, noho ihola lāua, ‘a‘ohe ‘ai o   Nāmakaokapāo‘o i ka ‘ai. I ia wā, e noho ana ‘o  ‘Ama‘u he ali‘i no O‘ahu nei, ma Waikīkī kahi i noho ai, hele maila kekahi kanaka no Honouliuli  mai ā hiki ma Waikīkī, e noho ana ke ali‘i. ‘Ōlelo  akula ia: “E ke alii ē\\! He ‘oi kahi keiki ‘u‘uku ikaika  loa, ua make kona makua kāne a ua kiola ‘ia kona  po‘o i kai loa, he wahi lō‘ihi loa, ‘elima mile ka  lō‘ihi. A lohe o ‘Ama‘u, aia kona ikaika a make au iā  ia, akā, i ‘ole au e make iā ia ‘a‘ohe ona ikaika. Iā ia  e ‘ōlelo ana ma Waikīkī, ua lohe nō ‘o   Nāmakaokapāo‘o i kēia mau ‘ōlelo nona.",
  "o4-mini_translation": "When Puali‘i died, Nāmakaokapāo‘o turned and went to his mother, Pōka‘i; the two of them lived alone, and Nāmakaokapāo‘o would not eat any food. At that time, ‘Ama‘u, a chief of O‘ahu, was residing at Waikīkī. A man came all the way from Honouliuli to Waikīkī, where the chief was staying, and said:  \n“O chief! There is a little child of exceptional strength—his father is dead, and his head was thrown far out to sea, five miles away.”  \nWhen ‘Ama‘u heard this, he thought, “Since he has such strength I will kill him,” but then he added, “No, I will not kill him—he has no strength.” As he spoke these words in Waikīkī, Nāmakaokapāo‘o overheard them.",
  "o4-mini_commentary": "**Paragraph 8:**• This paragraph is a digression from the story to clarify  that Nā-maka-o-ka-lani (the eyes of the heavens) and  Nā-maka-o-ka-i‘a (the eyes of the fish/man) are two  names used in the lyrics of the prayer chant. Nā maka-o-ka-lani defeats Nā-maka-o-ka-i‘a in the prose,  symbolically representing the defeat of the ‘Ai Kapu  by Christianity.",
  "raw_response": "<translation>\nWhen Puali‘i died, Nāmakaokapāo‘o turned and went to his mother, Pōka‘i; the two of them lived alone, and Nāmakaokapāo‘o would not eat any food. At that time, ‘Ama‘u, a chief of O‘ahu, was residing at Waikīkī. A man came all the way from Honouliuli to Waikīkī, where the chief was staying, and said:  \n“O chief! There is a little child of exceptional strength—his father is dead, and his head was thrown far out to sea, five miles away.”  \nWhen ‘Ama‘u heard this, he thought, “Since he has such strength I will kill him,” but then he added, “No, I will not kill him—he has no strength.” As he spoke these words in Waikīkī, Nāmakaokapāo‘o overheard them.\n</translation>\n\n<commentary>\nThis excerpt is part of a broader narrative describing the death of Puali‘i, the early hardships of the young ali‘i Nāmakaokapāo‘o with his mother Pōka‘i, and the moment when the chief ‘Ama‘u first hears of—and underestimates—Nāmakaokapāo‘o’s strength.\n</commentary>",
  "special_case": "grouped_commentary",
  "reference_translation": "When Puali‘i died, Nāmakaokapāo‘o went back  to his mother, Pōka‘ī, and the two lived together,  but Nāmakaokapāo‘o had nothing to eat. At that  time, ‘Ama‘u was a chief of O‘ahu in Waikīkī,  where he lived. A man of Honouliuli came to Waikīkī, where the chief was found. The man said,  “Chief, there is a little boy who is amazingly strong.  He killed his father and threw his head in the  ocean a really long distance away, five miles off.”  When ‘Ama‘u heard this, he said, “We’ll see how  strong he is if he kills me. But if he doesn’t kill me,  he isn’t strong at all.” When he said this in Waikīkī,  Nāmakaokapāo‘o heard what he was saying about  him.",
  "reference_commentary": "**Paragraphs 10—14**• From here, the story seems to extend the allegory of  Christianity’s defeat over the ‘Ai Kapu, with   Nāmakaokapāo‘o representing progressive   Protestant Christianity and everyone apart from his  mother, Pōka‘ī, and himself, representing Hawaiians’ futile attempts to hold onto ‘Ai Kapu culture."
}