{
  "chapter": "1",
  "paragraph": 11,
  "passage_id": "namakaokapaoo_ch1_p11",
  "hawaiian_text": "A laila, lawe akula ia i kona makuahine e hūnā ma ke ana o Waipouli. A nalo ka makuahine, ho'i maila ia ā ko lākou hale ma Keahumoa, noho ihola. Pi'i a'ela 'o Nāmakaokapāo'o ā luna o kaupoku o ka hale, wehe a'ela i ka mau'u o ke kua a me ke alo, a moe ihola ma waena i luna pono o ke kaupoku.",
  "kimi-k2-fireworks_translation": "Then he took his mother to hide in the cave of Waipouli. When the mother had disappeared into concealment, he returned home to their house at Keahumoa and dwelt there. Nāmakaokapāo'o climbed up onto the ridgepole of the house, uncovered the thatching of the back and front, and lay down right in the middle on the ridgepole.",
  "kimi-k2-fireworks_commentary": "**Paragraph 8:**• This paragraph is a digression from the story to clarify  that Nā-maka-o-ka-lani (the eyes of the heavens) and  Nā-maka-o-ka-i‘a (the eyes of the fish/man) are two  names used in the lyrics of the prayer chant. Nā maka-o-ka-lani defeats Nā-maka-o-ka-i‘a in the prose,  symbolically representing the defeat of the ‘Ai Kapu  by Christianity.",
  "raw_response": "<translation>\nThen he took his mother to hide in the cave of Waipouli. When the mother had disappeared into concealment, he returned home to their house at Keahumoa and dwelt there. Nāmakaokapāo'o climbed up onto the ridgepole of the house, uncovered the thatching of the back and front, and lay down right in the middle on the ridgepole.\n</translation>\n\n<commentary>\n**Paragraph 11:** • This paragraph marks Nāmakaokapāo'o's first act of violence directed toward his parent. In Hawaiian tradition, filial rebellion is a powerful omen indicating the collapse of established order, particularly when the child's action is preceded by divine or supernatural events; – The concealment in Wai-pouli (dark water) cave represents the traditional motif of temporary \"return to the womb\"—the womb being both a place of concealment (pouli) and potential rebirth. This act foreshadows Pōka'ī's future reemergence as a changed being in subsequent chapters; • Nāmakaokapāo'o's action of dismantling the house's thatch (mau'u: specifically grass thatching) carries deep cultural significance: – The ridgepole (kua-ve'e or kaupoku) represents the spine of the 'ohana (family), with the thatch (kua and alo) representing the protection and concealment of ancestral knowledge. By uncovering it, Nāmakaokapāo'o violates both physical and spiritual boundaries; – The act of lying on the ridgepole places him in the position of a hostile mo'o (spirit guardian) or 'aumākua who has reversed the natural order by claiming the central axis of the household instead of protecting it; • The sequence (concealment → return → violation of house boundaries) mirrors the heiau destruction practices where sacred spaces were first desecrated by removal of their protective coverings (kāhili, thatching) before more complete destruction. This suggests Nāmakaokapāo'o serves as a literal agent of kapu system dissolution; • The body of the house (kino o ka hale) is personified, making Nāmakaokapāo'o's action not merely destructive but cannibalistic—he \"consumes\" the family's protective spiritual structure by lying inside its exposed spine. This connects to his earlier actions of consuming the māla 'uala and prefigures the consumptive violence threatened by Puali'i.\n</commentary>",
  "special_case": "grouped_commentary",
  "reference_translation": "Nāmakaokapāo'o then took his mother to hide her in the cave of Waipouli. When his mother was well hidden, he went back to their house in Keahumoa and stayed there. Nāmakaokapāo'o climbed up onto the roof of the house and took apart the grass thatch of the ridge and the face and laid down on the ridge of the roof.",
  "reference_commentary": "**Paragraphs 10—14** • From here, the story seems to extend the allegory of Christianity's defeat over the 'Ai Kapu, with Nāmakaokapāo'o representing progressive Protestant Christianity and everyone apart from his mother, Pōka'ī, and himself, representing Hawaiians' futile attempts to hold onto 'Ai Kapu culture."
}