{
  "chapter": "1",
  "paragraph": 13,
  "passage_id": "namakaokapaoo_ch1_p13",
  "hawaiian_text": "'Ī aku 'o Nāmakaokapāo'o: \"Ua 'ike au, he kanaka nui nō 'o Nāmakaokapāo'o, a ua hele aku nei ma Ko'olau, a 'o wau he inoa nona.\" 'Ī mai lākou: \"'A'ole, 'o 'oe nō, pela ko makou lohe, no laila, e make ana 'oe iā mākou, 'a'ole 'oe e ola.\" 'Ī aku 'o Nāmakaokapāo'o: \"Ho'i aku ho'i hā kākou i lalo e hakakā ai.\" A hiki lākou i lalo, e hao aku ana 'o Nāmakaokapāo'o, pau loa i ka make, a koe aku ho'okahi kanaka, 'o ia ka i holo aku ā loa'a 'o 'Ama'u ma Waikīkī, 'ōlelo akula ia i ka make o lākou a pau loa, a koe ia i 'āha'ilono e lohe ai 'o 'Ama'u.",
  "kimi-k2-fireworks_translation": "Nāmakaokapāo'o said, \"I know, Nāmakaokapāo'o is indeed a great man, and he has gone to Ko'olau, and I am merely a name in place of him.\" They said, \"No, you are the one, that's what we've heard. Therefore, you shall be killed by us, you will not live.\" Nāmakaokapāo'o replied, \"Let us indeed go down below to fight.\" When they reached below, Nāmakaokapāo'o struck out, and they all perished, with just one man remaining, the one who fled and reached 'Ama'u at Waikīkī. He told of their total annihilation, and that only he survived as the messenger to inform 'Ama'u.",
  "kimi-k2-fireworks_commentary": "**Paragraph 8:**• This paragraph is a digression from the story to clarify  that Nā-maka-o-ka-lani (the eyes of the heavens) and  Nā-maka-o-ka-i‘a (the eyes of the fish/man) are two  names used in the lyrics of the prayer chant. Nā maka-o-ka-lani defeats Nā-maka-o-ka-i‘a in the prose,  symbolically representing the defeat of the ‘Ai Kapu  by Christianity.",
  "raw_response": "<translation>\nNāmakaokapāo'o said, \"I know, Nāmakaokapāo'o is indeed a great man, and he has gone to Ko'olau, and I am merely a name in place of him.\" They said, \"No, you are the one, that's what we've heard. Therefore, you shall be killed by us, you will not live.\" Nāmakaokapāo'o replied, \"Let us indeed go down below to fight.\" When they reached below, Nāmakaokapāo'o struck out, and they all perished, with just one man remaining, the one who fled and reached 'Ama'u at Waikīkī. He told of their total annihilation, and that only he survived as the messenger to inform 'Ama'u.\n</translation>\n\n<commentary>\n**Paragraph 13:** • The scene shifts to a dramatic confrontation where Nāmakaokapāo'o faces a death sentence based on mistaken identity – ironically, when he truthfully claims to be \"merely a name\" (he inoa) rather than the legendary figure, this very disclosure confirms his identity. The phrase he inoa nona carries profound cultural weight, as Hawaiian personal names function as inextricable extensions of the person, containing their mana, history, and destiny. – This moment reflects the Hawaiian concept of 'inoa pō (name from the night), where true identity transcends physical presence; \n\n• The adversaries' refusal to accept Nāmakaokapāo'o's distinction between the name and the person reveals the fatalistic nature of name magic in Hawaiian cosmology. To be named is to be that person, regardless of the speaker's intent. Their pronouncement e make ana 'oe iā mākou formalizes the death sentence with the protocol-laden grammar typical of retributive justice in 'Ai Kapu society;\n\n• The invitation to \"go down below\" (ho'i aku ho'i hā kākou i lalo) for combat follows the traditional protocol for settling disputes through single combat in designated areas, typically below (i lalo) wahi kapu or in areas removed from sacred spaces. The phrase hā kākou (indeed, emphatically, let us) signals acceptance of the challenge with full knowledge of the consequences;\n\n• Nāmakaokapāo'o's annihilation of his opponents (pau loa i ka make) demonstrates his divine warrior nature, aligning with ancestral accounts of superhuman combatants like Kamehameha's legendary battles. The survival of precisely one individual as messenger follows Hawaiian narrative convention – the lone witness ensures transmission of events while serving justice; the survivor's name 'Ama'u (a climbing fern known for tenacious growth) metaphorically represents the persistence of information through peril.\n\n• The journey to Waikīkī continues the geographic threading of the narrative, moving from Ko'olau toward 'Ewa's southern coast, establishing the legendary landscape as precisely mapped territory. That the sole survivor carries news to 'Ama'u (present Ali'i of whichever district/social grouping is opposing Nāmakaokapāo'o) signifies the formal protocol where messengers bearing news of defeat must run directly to their chief, often along established messenger paths known as ala hele ku'ukū. The designation 'āha'ilono (messenger/rumor/spirit) confirms the interweaving of literal running messenger with supernatural communication, as Hawaiian history often records such runners as possessed or visionary figures.\n</commentary>",
  "special_case": "grouped_commentary",
  "reference_translation": "Nāmakaokapāo'o said, \"I know. Nāmakaokapāo'o is a really big guy. He went to Ko'olau. I'm named after him.\" The soldiers said, \"No, it's you. That's what we heard. So, we're going to kill you. You won't survive.\" Nāmakaokapāo'o said, \"Well, let's go down and fight.\" When they got down, Nāmakaokapāo'o went to work and killed them all except one man, who ran off and reached 'Ama'u in Waikīkī. He told him about the how they were all killed except for one runner to go and tell 'Ama'u about it.",
  "reference_commentary": "**Paragraphs 10—14** • From here, the story seems to extend the allegory of Christianity's defeat over the 'Ai Kapu, with Nāmakaokapāo'o representing progressive Protestant Christianity and everyone apart from his mother, Pōka'ī, and himself, representing Hawaiians' futile attempts to hold onto 'Ai Kapu culture."
}