{
  "chapter": "1",
  "paragraph": 4,
  "passage_id": "namakaokapaoo_ch1_p4",
  "hawaiian_text": "Noho ihola i laila, mahi ‘ai, ‘elua āna mau māla  ‘uala lō‘ihi e waiho nei ā hiki i kēia lā, a ua kapa ‘ia  ka inoa o ia mau māla, ‘o Nāmakaokapāo‘o ā hiki i  kēia lā. A o‘o ka ‘uala, ‘ōlelo ‘o Puali‘i i kāna ‘ōlelo   ho‘ohiki, “Aia ā kālua ke po‘o o ka ulua me ka ‘uala,  a ‘ai ‘o Puali‘i, a laila, noa, ‘ai kāna wahine, Pōka‘ī a  me nā mea ‘ē a‘e. No laila, iho akula ‘o Puali‘i i kai  o Honouliuli e lawai‘a i i‘a ‘ai pū me ka ‘uala.",
  "kimi-k2-fireworks_translation": "They lived there, working as farmers, with two long rows of his sweet potato patches that exist to this day, and those patches were named Nāmakaokapāo‘o, a name kept until today. When the sweet potatoes matured, Puali‘i made his solemn oath, \"When the head of an ulua is baked together with the sweet potatoes and Puali‘i eats, then the restriction is over and his woman Pōka‘ī and others may eat.\" Therefore, Puali‘i went down to the sea of Honouliuli to fish for fish to eat with the sweet potatoes.",
  "kimi-k2-fireworks_commentary": "**Paragraph 4:**\n\n• The establishing of named māla 'uala (sweet potato patches) marks a significant moment of land tenure and lasting legacy. The phrase \"mau māla 'uala lō'ihi\" (long sweet potato patches) suggests these were permanent, well-maintained gardens, likely aligned with the contour of the land using traditional dryland cultivation techniques. The explicit statement that they \"exist to this day\" signals this as an origin account explaining real landscape features known to the storyteller's audience.\n\n– The naming of the patches \"Nāmakaokapāo'o\" serves multiple functions: it creates a living memorial to the child who bears this name; it permanently links the land to the family genealogy; and it represents the fruits of Pōka'ī's labor as a single mother farming in Līhu'e. The fact that the patches retain this name \"ā hiki i kēia lā\" (until today) suggests these were actual place names known to the community, anchoring the narrative in geographic reality.\n\n• Puali'i's 'ōlelo ho'ohiki (solemn oath) reveals crucial details about 'Ai Kapu ritual practice. His declaration creates a kapu (restriction) centered on the consumption of specific foods - here the combination of ulua head with sweet potatoes constitutes a ceremonial meal. The formula \"aia ā...a laila\" (when...then) follows typical Hawaiian invocation patterns for establishing temporary ritual restrictions.\n\n– The kapu system described here operates on two levels: First, it restricts consumption until Puali'i completes a ritual act (eating the ulua head with sweet potatoes); Second, it includes a deliberate inclusion of \"nā mea 'ē a'e\" (others) in the eventual lifting of restriction, suggesting community participation in ending the kapu. This differs from more exclusive kapu systems that might restrict access entirely.\n\n– The ulua (Caranx species) carries deep symbolic weight in this context. As a large predatory fish, ulua represents masculine strength and chiefly authority. The \"po'o\" (head) specifically denotes the most sacred portion of the catch in 'Ai Kapu practice. Combining ulua head with 'uala creates a synthesis of ocean and land foods, masculine and feminine productive domains, binding Puali'i symbolically to both his male role as provider and to Pōka'ī's domain as farmer.\n\n• The act of descent to kai (seashore) of Honouliuli for fishing represents a recurring motif in Hawaiian narrative where inland people (maka'āinana) journey to the coast to complete the food cycle. Honouliuli's sheltered waters and abundance of reef and lagoon species made it an ideal location for shore fishing, particularly for ulua which congregate near reef edges.\n\n– This movement from mauka (inland) to makai (seaward) creates spatial symmetry with previous movements in the narrative, establishing Līhu'e as an agricultural center connected through Puali'i's marriage and fishing activities to the coastal zone of 'Ewa.",
  "raw_response": "<translation>\nThey lived there, working as farmers, with two long rows of his sweet potato patches that exist to this day, and those patches were named Nāmakaokapāo‘o, a name kept until today. When the sweet potatoes matured, Puali‘i made his solemn oath, \"When the head of an ulua is baked together with the sweet potatoes and Puali‘i eats, then the restriction is over and his woman Pōka‘ī and others may eat.\" Therefore, Puali‘i went down to the sea of Honouliuli to fish for fish to eat with the sweet potatoes.\n</translation>\n\n<commentary>\n**Paragraph 4:**\n\n• The establishing of named māla 'uala (sweet potato patches) marks a significant moment of land tenure and lasting legacy. The phrase \"mau māla 'uala lō'ihi\" (long sweet potato patches) suggests these were permanent, well-maintained gardens, likely aligned with the contour of the land using traditional dryland cultivation techniques. The explicit statement that they \"exist to this day\" signals this as an origin account explaining real landscape features known to the storyteller's audience.\n\n– The naming of the patches \"Nāmakaokapāo'o\" serves multiple functions: it creates a living memorial to the child who bears this name; it permanently links the land to the family genealogy; and it represents the fruits of Pōka'ī's labor as a single mother farming in Līhu'e. The fact that the patches retain this name \"ā hiki i kēia lā\" (until today) suggests these were actual place names known to the community, anchoring the narrative in geographic reality.\n\n• Puali'i's 'ōlelo ho'ohiki (solemn oath) reveals crucial details about 'Ai Kapu ritual practice. His declaration creates a kapu (restriction) centered on the consumption of specific foods - here the combination of ulua head with sweet potatoes constitutes a ceremonial meal. The formula \"aia ā...a laila\" (when...then) follows typical Hawaiian invocation patterns for establishing temporary ritual restrictions.\n\n– The kapu system described here operates on two levels: First, it restricts consumption until Puali'i completes a ritual act (eating the ulua head with sweet potatoes); Second, it includes a deliberate inclusion of \"nā mea 'ē a'e\" (others) in the eventual lifting of restriction, suggesting community participation in ending the kapu. This differs from more exclusive kapu systems that might restrict access entirely.\n\n– The ulua (Caranx species) carries deep symbolic weight in this context. As a large predatory fish, ulua represents masculine strength and chiefly authority. The \"po'o\" (head) specifically denotes the most sacred portion of the catch in 'Ai Kapu practice. Combining ulua head with 'uala creates a synthesis of ocean and land foods, masculine and feminine productive domains, binding Puali'i symbolically to both his male role as provider and to Pōka'ī's domain as farmer.\n\n• The act of descent to kai (seashore) of Honouliuli for fishing represents a recurring motif in Hawaiian narrative where inland people (maka'āinana) journey to the coast to complete the food cycle. Honouliuli's sheltered waters and abundance of reef and lagoon species made it an ideal location for shore fishing, particularly for ulua which congregate near reef edges.\n\n– This movement from mauka (inland) to makai (seaward) creates spatial symmetry with previous movements in the narrative, establishing Līhu'e as an agricultural center connected through Puali'i's marriage and fishing activities to the coastal zone of 'Ewa.",
  "reference_translation": "They lived there and farmed, and Puali‘i had two  long sweet potato patches that remain until today,  and the patches were given the name,   Nāmakaokapāo‘o until today. When the sweet  potatoes were mature, Puali‘i said made a  promise, saying, “I’ll cook the head of an ulua fish  in the imu along with some sweet potatoes. When  Puali‘i eats, then the food will be made free for his  woman, Pōka‘ī, and anyone else.” So, Puali‘i went  down to the shore of Honouliuli to fish for a catch  to eat with sweet potatoes.",
  "reference_commentary": "**Paragraph 4:**• Pua-li‘i is a farmer with 2 long sweet potato patches  that lasted until the publication of this story. The  name of this sweet potato garden was known as *Nā maka-o-ka-pāo‘o*, the name of Pō-ka-‘ī’s son, and  victorious hero of the story;  • When the sweet potatoes were ready for harvest,  Pua-li‘i said that when he eats ulua fish with sweet  potatoes, cooked in the imu. The food would then be  made free for others, particularly Pō-ka-‘ī and Nā maka-o-ka-pāo‘o after he eats.  – The emphasis on Pua-li‘i, a male and head of the  family, eating, with his woman and child being  allowed to eat separately after he was done, is a  custom of ‘Ai Kapu culture;  • Having announced the eating routine/schedule, Pua li‘i then went to Hono-uliuli (dark bay) to fish for  ulua.  – The choice of ulua to eat with the ‘uala (sweet  potato) is likely due to the similarity in the   pronunciation of the two words, signifying ʻwhat is  above, so below,’ an old and recurring esoteric  feature of Hawaiian prosidy and culture, with a  lesson that there should always be balance in life  and in human practices (above-below; left-right;  male-female). This is the essence of ʻpono’;"
}