{
  "chapter": "1",
  "paragraph": 12,
  "passage_id": "namakaokapaoo_ch1_p12",
  "hawaiian_text": "Ho'ouna maila 'o 'Ama'u ke ali'i mai Waikīkī mai, 'ehā po'e kaua, aia ma ka po'e ho'okahi he kanahā kumamāwalu kānaka ka nui, pēlā ā pau nā po'e 'ehā. A hiki lākou ma ke kula o Keahumoa, komo lākou ā loko o ka hale, 'a'ohe kanaka. A mākaukau lākou e ho'i, kāhea mai 'o Nāmakaokapāo'o i luna o kaupoku. A lohe lākou i ka leo, 'a'ohe na'e he 'ike 'ia o ke kino, nīnau aku lākou: \"'Auhea 'oe e wala'au nei?\" 'Ī mai 'o Nāmakaokapāo'o: \"Eia nō wau i luna nei.\" Pi'i a'ela 'ewalu kānaka, 'ehā ma ke kua o ka hale, 'ehā ma ke alo o ka hale ā loa'a 'o Nāmakaokapāo'o. 'Ī mai 'o Nāmakaokapāo'o: \"He aha mai nei kā 'oukou o 'one'i?\" 'Ī aku lākou: \"I hele mai nei mākou e kaua me Nāmakaokapāo'o, he wahi keiki 'u'uku e like me 'oe, he ikaika a me ke koa loa, nāna nō i pepehi i kona makua kāne, 'o Puali'i.\"",
  "kimi-k2-fireworks_translation": "The chief 'Ama'u sent from Waikīkī, four groups of warriors, with each group numbering forty-eight men, thus making four groups in all. When they arrived at the plains of Keahumoa, they entered into the house—no one was there. As they were about to leave, Nāmakaokapāo'o called out from the rooftop. They heard the voice but could not see the body and asked, \"Where are you who calls out?\" Nāmakaokapāo'o said, \"Here I am above.\" Eight men climbed up, four at the back of the house and four at the front of the house, and they found Nāmakaokapāo'o. Nāmakaokapāo'o said, \"What brings you here?\" They said, \"We have come to fight with Nāmakaokapāo'o, a small child just like you, who is very strong and brave, the very one who killed his father, Puali'i.\"",
  "kimi-k2-fireworks_commentary": "**Paragraph 8:**• This paragraph is a digression from the story to clarify  that Nā-maka-o-ka-lani (the eyes of the heavens) and  Nā-maka-o-ka-i‘a (the eyes of the fish/man) are two  names used in the lyrics of the prayer chant. Nā maka-o-ka-lani defeats Nā-maka-o-ka-i‘a in the prose,  symbolically representing the defeat of the ‘Ai Kapu  by Christianity.",
  "raw_response": "<translation>\nThe chief 'Ama'u sent from Waikīkī, four groups of warriors, with each group numbering forty-eight men, thus making four groups in all. When they arrived at the plains of Keahumoa, they entered into the house—no one was there. As they were about to leave, Nāmakaokapāo'o called out from the rooftop. They heard the voice but could not see the body and asked, \"Where are you who calls out?\" Nāmakaokapāo'o said, \"Here I am above.\" Eight men climbed up, four at the back of the house and four at the front of the house, and they found Nāmakaokapāo'o. Nāmakaokapāo'o said, \"What brings you here?\" They said, \"We have come to fight with Nāmakaokapāo'o, a small child just like you, who is very strong and brave, the very one who killed his father, Puali'i.\"\n</translation>\n\n<commentary>\n**Paragraph 12:** • The number symbolism continues in this passage: 4 groups × 4 = 16, and 48 × 4 = 192 warriors total (with 4 × 8 = 32 who actually ascend). These groups of four (the sacred number) represent the four major islands or four quadrants of the cosmos, suggesting this is not merely a local conflict but carries cosmic significance;\n\n– 'Ama'u (the mother-of-pearl, a type of fern) as chief-name suggests a connection to liminal spaces and transformation—ferns grow in transitional areas between land types, and mother-of-pearl appears on shells that transform into tools/ornaments. His dispatch from Waikīkī (spouting water) likely indicates he represents old-order authority from the productive Kona coast region;\n\n• The warriors' methodical entry into the empty house followed by calling up to the rooftop reflects the traditional protocol of house-visiting, inverted here—the boy observes the warriors rather than vice-versa. The house structure (back/front, above/below) replicates the three-part Hawaiian cosmos (pō, 'āina, lani) with Nāmakaokapāo'o occupying the most elevated position (lani/the heavens);\n\n– Their identification of Nāmakaokapāo'o as \"he wahi keiki 'u'uku\" (a certain small child) contrasted with his actual presence above them suggests the traditional motif of underestimating the trickster-hero. The warriors' statement that this small child killed his father carries double meaning: Puali'i (the stepfather) was \"father\" by marriage but not by blood, indicating Nāmakaokapāo'o has in fact destroyed the old Ai Kapu order represented by Puali'i;\n\n• The warriors' inability to see Nāmakaokapāo'o's body despite hearing his voice suggests he operates partially in a different realm/dimension—a common signifier in Hawaiian narratives for persons of divine heritage who can access the akua realm. His strategic positioning above them indicates his tactical superiority even before physical confrontation begins.\n</commentary>",
  "special_case": "grouped_commentary",
  "reference_translation": "Chief 'Ama'u sent four regiments of soldiers from Waikīkī totalling forty-eight men. When they reached the plains of Keahumoa, they entered the house, but no one was there. When they were ready to return back to Waikīkī, Nāmakaokapāo'o called out from on top of the roof. They heard the voice, but didn't see any body, and they asked, \"Where is that voice coming from?\" Nāmakaokapāo'o said, \"I'm up here.\" Eight men climbed up, four men went onto the roof and four on the face of the house and got a hold of Nāmakaokapāo'o. Nāmakaokapāo'o said, \"What in the world are you all doing here?\" They said, \"We came to fight Nāmakaokapāo'o, a little boy like you, who is really strong and brave. He killed his father, Puali'i.\"",
  "reference_commentary": "**Paragraphs 10—14** • From here, the story seems to extend the allegory of Christianity's defeat over the 'Ai Kapu, with Nāmakaokapāo'o representing progressive Protestant Christianity and everyone apart from his mother, Pōka'ī, and himself, representing Hawaiians' futile attempts to hold onto 'Ai Kapu culture."
}