{
  "chapter": "1",
  "paragraph": 14,
  "passage_id": "namakaokapaoo_ch1_p14",
  "hawaiian_text": "A lohe 'o 'Ama'u, ho'omākaukau ihola ia i kona mau wa'a kaua he 'umi kumamāwalu, a holo akula i lalo o 'Ewa e kaua me Nāmakaokapāo'o. A hiki 'o 'Ama'u me kona po'e kānaka ma 'Ewa, e noke mai ana 'o Nāmakaokapāo'o i ka luku ā pau loa, 'a'ohe kanaka koe, a make ihola 'o 'Ama'u. Puni a'ela 'o O'ahu nei iā Nāmakaokapāo'o, a laila, ki'i akula ia i kona makuahine a ho'onoho ihola i luna o ka 'āina O'ahu nei.",
  "kimi-k2-fireworks_translation": "When 'Ama'u heard, he prepared his eighteen war canoes and sailed down to 'Ewa to battle with Nāmakaokapāo'o. When 'Ama'u arrived at 'Ewa with his people, Nāmakaokapāo'o was continuously striking until all were gone, not a single person remained, and 'Ama'u died. The island of O'ahu was completely taken by Nāmakaokapāo'o, then he fetched his mother and established her upon the land here on O'ahu.",
  "kimi-k2-fireworks_commentary": "**Paragraph 8:**• This paragraph is a digression from the story to clarify  that Nā-maka-o-ka-lani (the eyes of the heavens) and  Nā-maka-o-ka-i‘a (the eyes of the fish/man) are two  names used in the lyrics of the prayer chant. Nā maka-o-ka-lani defeats Nā-maka-o-ka-i‘a in the prose,  symbolically representing the defeat of the ‘Ai Kapu  by Christianity.",
  "raw_response": "<translation>\nWhen 'Ama'u heard, he prepared his eighteen war canoes and sailed down to 'Ewa to battle with Nāmakaokapāo'o. When 'Ama'u arrived at 'Ewa with his people, Nāmakaokapāo'o was continuously striking until all were gone, not a single person remained, and 'Ama'u died. The island of O'ahu was completely taken by Nāmakaokapāo'o, then he fetched his mother and established her upon the land here on O'ahu.\n</translation>\n\n<commentary>\nParagraph 14: • The narrative reaches its moment of climactic consequence and territorial expansion. A new figure, 'Ama'u (the gathering/fetching of young taro leaves), arrives as a military leader - his name suggesting nourishment and sustenance, symbolic of agricultural abundance. His force of eighteen war canoes ('umi kumamāwalu) indicates both significant preparation and the customary practice of assembling fleets for major expeditions - the number eighteen carrying possible calendrical significance (three sixes, the number of days in the Hawaiian week doubled plus four, as months often have four weeks).\n\n– 'Ama'u sails i lalo o 'Ewa (downward to 'Ewa), following the traditional directional system of mauka/makai and the flow of water, suggesting both literal descent from upland areas and the lowering of his people's fortune. The location 'Ewa, here portrayed as under Nāmakaokapāo'o's control, historically represents the fruitful plains of central O'ahu and serves as a strategic point for controlling the entire island.\n\n- The phrase luku ā pau loa (utter destruction until complete) mirrors ancient descriptions of total warfare and land clearance. The term luku specifically refers to the complete annihilation or destruction of a place - often used in chants describing volcanic eruptions, war conquest, or the clearing of brush for planting. The emphatic nature of this destruction ('a'ohe kanaka koe - not even one person remained) suggests the breaking down of the old order to prepare for new governance.\n\n- Following complete conquest, Nāmakaokapāo'o performs the crucial cultural act of ho'onoho (installing/placing) his mother upon the land. This action references the ancient practice of a victorious ali'i establishing his most trusted relative - usually a parent or grandparent - as kuhina nui or regent of newly conquered territory. The phrase luna o ka 'āina represents both literal elevation to positions of authority and spiritual elevation of the land itself under new management.\n\n- The use of nei (here) in 'O'ahu nei creates an intimate connection between the narrator (land) and the reader - suggesting the story was told to local descendants of those who experienced these events. This rhetorical device marks the transition from personal vendetta to imperial conquest, elevating Nāmakaokapāo'o from child avenger to island ruler - embodying the Hawaiian understanding that those who control ancestral lands through warfare must honor the maternal ancestral line to maintain sovereignty.\n</commentary>",
  "special_case": "grouped_commentary",
  "reference_translation": "When 'Ama'u heard about it, he prepared eighteen of his war canoes and went over to 'Ewa to make war with Nāmakaokapāo'o. When 'Ama'u reached 'Ewa with his men, Nāmakaokapāo'o went to work killing them all sparing no one, and that is how 'Ama'u died. All of O'ahu fell to Nāmakaokapāo'o. Then he went and got his mother and set her up as ruler over all of O'ahu.",
  "reference_commentary": "**Paragraphs 10—14** • From here, the story seems to extend the allegory of Christianity's defeat over the 'Ai Kapu, with Nāmakaokapāo'o representing progressive Protestant Christianity and everyone apart from his mother, Pōka'ī, and himself, representing Hawaiians' futile attempts to hold onto 'Ai Kapu culture."
}