{
  "row_id": 1,
  "hawaiian_text": "No ka pololi loa o Pikoiakaalala nalo aku la ia mai ke anaina kanaka aku, hoi aku la ia a hiki i kona mau kaikuahine, ua moa ka puaa a me ka ai. Mamua o ka paina ana, pane aku o Pikoiakaalala: “E hoolohe mai oukou a pau loa, he wahi kanawai ko’u no ka ai ana, penei: “Aohe walaau, aohe hawanawana, aohe kunou, aohe iniki, aohe hamumu, a pau kuu paina ana.” Lalau aku la ia i ka puaa, hookahi kaka, o ke poi uala, hookahi nau ana, a moni, lalau hou, kokoke e pau ka puaa okoa, a me ka ai a pau o ka umu. Pane mai kekahi kanaka: “He ai na ke Akua.” Oki iho la keia. Pane mai na kaikoeke: “E oki ana ka hoi i ke aha ka ai ana?” “Aole, ua maona ae la no.” “Ae, ua lohe la hoi makou i kou kanawai,” pela na kaikoeke. Ma keia ai ana a Pikoiakaalala, ua pii kona kino a lilo i kanaka nui a me ka maikai, o ka lauoho nae he lauoho iole.",
  "reference_translation": "As Pikoiakaalala was very hungry he disappeared from the people who had gathered at this place and returned to his sisters, where he found the pig and food cooked. Before he sat down to eat Pikoiakaalala addressed the people, saying: “I want you all to understand that I have certain rules in connection with my meals. There must be no talking, no whispering, no nodding, no pinching and no noise of any kind should be heard until I finish my meal.” He then reached for a piece of pork and a dish of potato, taking one bite of each which he swallowed; he then reached for another piece of pork, almost finishing the pig, and all the food of the oven. At this one of the men remarked: “He eats like a god.” On hearing this Pikoiakaalala stopped eating. His brothers-in-law then said: “Why don’t you go on eating?” “No, I have had enough.” “Yes, we already heard your rule,” said his brother-in-law. In this one meal partaken by Pikoiakaalala, he grew into a large and fine looking man, but his hair was [like] rat’s hair.",
  "QwQ-32B-exl2-6_5bpw-maui_translation": "Okay, I need to translate this Hawaiian text into English. Let me start by reading through the entire passage to get a sense of the context. It seems like a traditional story or legend involving someone named Pikoiakaalala. There are mentions of pigs, food, and some rules about eating. \n\nFirst, I'll go sentence by sentence. The first line: \"No ka pololi loa o Pikoiakaalala nalo aku la ia mai ke anaina kanaka aku, hoi aku la ia a hiki i kona mau kaikuahine, ua moa ka puaa a me ka ai.\" \n\nBreaking it down: \"No ka pololi loa\" probably means \"Because of the long wait\" or \"After a long wait.\" \"Pikoiakaalala\" is a name, so I'll keep that as is. \"Nalo aku la ia mai ke anaina kanaka aku\" – \"he was lost from the crowd of people.\" \"Hoi aku la ia a hiki i kona mau kaikuahine\" – \"he returned and reached his aunts.\" \"Ua moa ka puaa a me ka ai\" – \"the pig and the food were cooked.\" \n\nNext sentence: \"Mamua o ka paina ana, pane aku o Pikoiakaalala: “E hoolohe mai oukou a pau loa, he wahi kanawai ko’u no ka ai ana, penei: “Aohe walaau, aohe hawanawana, aohe kunou, aohe iniki, aohe hamumu, a pau kuu paina ana.”\" \n\n\"Mamua o ka paina ana\" – \"Before the feast began.\" \"Pane aku o Pikoiakaalala\" – \"Pikoiakaalala spoke.\" The quote starts with \"E hoolohe mai oukou a pau loa\" – \"Listen all of you.\" \"He wahi kanawai ko’u no ka ai ana\" – \"My decree regarding the eating is this.\" Then listing prohibitions: \"Aohe walaau, aohe hawanawana, aohe kunou, aohe iniki, aohe hamumu\" – \"No arguing, no whispering, no quarreling, no fighting, no grumbling.\" \"a pau kuu paina ana\" – \"and that's the end of my decree.\"\n\nContinuing: \"Lalau aku la ia i ka puaa, hookahi kaka, o ke poi uala, hookahi nau ana, a moni, lalau hou, kokoke e pau ka puaa okoa, a me ka ai a pau o ka umu.\" \n\n\"Lalau aku la ia i ka puaa\" – \"He distributed the pig.\" \"Hookahi kaka\" – \"One portion.\" \"O ke poi uala\" – \"The taro poi.\" \"Hookahi nau ana\" – \"One portion each.\" \"A moni, lalau hou, kokoke e pau ka puaa okoa\" – \"Then he divided again, and finished distributing the entire pig.\" \"A me ka ai a pau o ka umu\" – \"and all the food from the imu (earth oven).\"\n\nNext part: \"Pane mai kekahi kanaka: “He ai na ke Akua.” Oki iho la keia.\" \n\n\"Pane mai kekahi kanaka\" – \"Someone spoke up: 'This is God's food.'\" \"Oki iho la keia\" – \"That was settled.\"\n\nThen: \"Pane mai na kaikoeke: “E oki ana ka hoi i ke aha ka ai ana?” “Aole, ua maona ae la no.” “Ae, ua lohe la hoi makou i kou kanawai,” pela na kaikoeke.\" \n\n\"Pane mai na kaikoeke\" – \"The servers spoke: 'Should we stop serving the food?'\" \"“Aole, ua maona ae la no.”\" – \"No, it's already been distributed.\" \"“Ae, ua lohe la hoi makou i kou kanawai,”\" – \"Yes, we heard your decree,\" said the servers.\n\nFinal sentence: \"Ma keia ai ana a Pikoiakaalala, ua pii kona kino a lilo i kanaka nui a me ka maikai, o ka lauoho nae he lauoho iole.\" \n\n\"Ma keia ai ana a Pikoiakaalala\" – \"At this feast of Pikoiakaalala.\" \"ua pii kona kino a lilo i kanaka nui a me ka maikai\" – \"his body became respected and he became esteemed by many.\" \"o ka lauoho nae he lauoho iole\" – \"his hair became curly hair.\" Wait, \"lauoho iole\" might mean \"curly hair\" or \"bushy hair\"? Maybe \"curly\" is better here.\n\nI need to make sure the names and terms are correctly translated. \"Kaikuahine\" are aunts, \"umu\" is the earth oven, \"poi uala\" is sweet potato poi. The prohibitions are clear. The servers are \"kaikoeke,\" which might be servers or distributors. \n\nPutting it all together, ensuring the flow makes sense. The story seems to be about Pikoiakaalala hosting a feast with strict rules, distributing food properly, and gaining respect, with a mention of his hair changing. I should check for any possible mistranslations, especially in the prohibitions and the ending about his hair. Maybe \"lauoho iole\" is \"curly hair\" as a result of the feast's success? \n\nAlright, time to structure the translation with proper grammar and coherence.\n</think>\n\n<translation>\nAfter a long wait, Pikoiakaalala was separated from the crowd of people and returned to his aunts, where the pig and the food were already cooked. Before the feast began, Pikoiakaalala addressed them: “Listen all of you, my decree regarding the eating is this: No arguing, no whispering, no quarreling, no fighting, no grumbling—this concludes my proclamation.” He then distributed the pig, portion by portion, along with the taro poi, giving each person their share. He divided again and again until the entire pig and all the food from the imu (earth oven) were fully distributed. \n\nA person spoke up: “This is God’s food.” That settled it. The servers asked, “Should we stop serving the food?” “No, it has already been distributed,” they were told. “Yes, we have heard your decree,” replied the servers. \n\nAt this feast of Pikoiakaalala, his body gained respect and he became esteemed by many. His hair, however, turned curly. \n</translation>"
}