{
  "row_id": 6,
  "hawaiian_text": "O Makiioeoe ka makuakane, o Hina ka makuahine (o Kuaihelani ko Makiioeoe aina, oia ke ’lii olaila, he wahine no kana e noho ana i Kuaihelani, hookahi keiki me ia wahine, o Kahikiula ka inoa). No Kauai o Hina, ilaila kahi i loaa ai o Laukiamanuikahiki. Mai Kuaihelani ka Makiioeoe hele ana mai, a loaa o Hina i Kauai, moe laua; a liuliu, hapai o Hina. Ia wa, hoi o Makiioeoe i Kuaihelani, olelo aku ia Hina: “E, ke hoi nei au; e noho oe a i hanau he keiki kane, kapa oe i kuu inoa; a i hanau he kaikamahine, kapa oe i ka inoa o Laukiamanuikahiki. I hanai oe a i nui, a manao e hele ae e imi ia’u, eia na hoailona, he lei palaoa, he kupee, he ahuula, he waa nui, he waa iki, he kanaka nui, he kanaka iki, he waa ula, he pea ula, he ka ulaula, he aha ula, he kanaka ula.” Hoi aku la o Makiioeoe i Kuaihelani, me ka olelo i na kiai i ke ano o ke kaikamahine, a me ke kanu i na mea a pau loa no Laukiamanuikahiki, na kiowai a me na mea e ae, kapu a noa ia Laukiamanuikahiki.",
  "reference_translation": "Makiioeoe was the father and Hina was the mother of Laukiamanuikahiki. Kuaihelani was the home of Makiioeoe where he ruled as king and where his queen lived from whom he had one child, Kahikiula by name. Hina belonged to Kauai, where Laukiamanuikahiki was born. Makiioeoe in his travels came to Kauai where he met Hina and took her to wife, and after living with her for some time, Hina conceived a child. Shortly after this Makiioeoe prepared to return to Kuaihelani; so he said to Hina: “I am going home. If you should give birth to a boy give him my name; but in case it should be a girl call her Laukiamanuikahiki. If after you bring the child up she should express a desire to come in search of me, these shall be the tokens by which I shall recognize the child: this necklace of whale’s teeth, this bracelet, this feather cloak. She must be accompanied by a large canoe, a small canoe, large men, small men, a red canoe, red sails, red bailing cup, red cords and a red man.” Makiioeoe then took his leave and returned to Kuaihelani. When he arrived home he instructed his guards as to the sign by which to recognize his daughter and he also instructed his servants to proceed and plant all kinds of fruit and other things for his daughter Laukiamanuikahiki. He also caused a pool of water to be made as well as other things and placed a kapu on them all to be free only after the same shall have been used by Laukiamanuikahiki.",
  "qwq-32b-awq-maui_translation": "<translation>\nMakiioeoe is the father, Hina is the mother (Kuaihelani is Makiioeoe’s homeland; he is the chief there, the woman who lives with him in Kuaihelani, they have one child whose name is Kahikiula). Hina is from Kauai, where Laukiamanuikahiki was obtained. From Kuaihelani, Makiioeoe comes to Kauai, finds Hina there, and they sleep together; afterward, Hina becomes pregnant. At that time, Makiioeoe returns to Kuaihelani and tells Hina: “E, I am returning; you stay, and if a boy is born, name him my name; and if a girl is born, name her Laukiamanuikahiki. Raise her and when she grows up and wants to come find me, here are the signs: a lei palaoa (a whale-tooth pendant), a bracelet, a feather cloak, a large canoe, a small canoe, many people, a small person, a red canoe, a red boat, a red fishhook, a red rope, a red person.” Makiioeoe then returns to Kuaihelani, giving instructions to the guardians regarding the appearance of the girl and the cultivation of all things needed for Laukiamanuikahiki, including kiowai (water vines) and other appropriate things, both sacred and common, for Laukiamanuikahiki.  \n</translation>"
}