{
  "row_id": 1,
  "hawaiian_text": "No ka pololi loa o Pikoiakaalala nalo aku la ia mai ke anaina kanaka aku, hoi aku la ia a hiki i kona mau kaikuahine, ua moa ka puaa a me ka ai. Mamua o ka paina ana, pane aku o Pikoiakaalala: “E hoolohe mai oukou a pau loa, he wahi kanawai ko’u no ka ai ana, penei: “Aohe walaau, aohe hawanawana, aohe kunou, aohe iniki, aohe hamumu, a pau kuu paina ana.” Lalau aku la ia i ka puaa, hookahi kaka, o ke poi uala, hookahi nau ana, a moni, lalau hou, kokoke e pau ka puaa okoa, a me ka ai a pau o ka umu. Pane mai kekahi kanaka: “He ai na ke Akua.” Oki iho la keia. Pane mai na kaikoeke: “E oki ana ka hoi i ke aha ka ai ana?” “Aole, ua maona ae la no.” “Ae, ua lohe la hoi makou i kou kanawai,” pela na kaikoeke. Ma keia ai ana a Pikoiakaalala, ua pii kona kino a lilo i kanaka nui a me ka maikai, o ka lauoho nae he lauoho iole.",
  "reference_translation": "As Pikoiakaalala was very hungry he disappeared from the people who had gathered at this place and returned to his sisters, where he found the pig and food cooked. Before he sat down to eat Pikoiakaalala addressed the people, saying: “I want you all to understand that I have certain rules in connection with my meals. There must be no talking, no whispering, no nodding, no pinching and no noise of any kind should be heard until I finish my meal.” He then reached for a piece of pork and a dish of potato, taking one bite of each which he swallowed; he then reached for another piece of pork, almost finishing the pig, and all the food of the oven. At this one of the men remarked: “He eats like a god.” On hearing this Pikoiakaalala stopped eating. His brothers-in-law then said: “Why don’t you go on eating?” “No, I have had enough.” “Yes, we already heard your rule,” said his brother-in-law. In this one meal partaken by Pikoiakaalala, he grew into a large and fine looking man, but his hair was [like] rat’s hair.",
  "qwq-32b-awq-maui_translation": "<translation>\nDue to Pikoiakaalala's prolonged fast, he turned away from the multitude of people, returned to his sisters, and prepared the pig and the food. Before the feast, Pikoiakaalala addressed them: “Listen attentively, my proclamation is this law for the feast: No envy, no gossip, no quarreling, no jealousy, no hostility—all my decrees shall be followed.” He distributed the pig, one portion of taro poi, one portion each, and money. He distributed again, continuing until the entire pig was finished, along with all the food from the oven. Another person spoke: “This is God’s food.” Thus it ended. The servers asked: “Will the return be acceptable for the feast?” “Yes, it is already pleasing,” they said. “Indeed, we have also heard your laws,” the servers replied. Through Pikoiakaalala’s feast, his body grew strong, winning many people’s favor and respect, though his hair alone became white.\n</translation>"
}