{
  "row_id": 4,
  "hawaiian_text": "I ka lua o ka po, hiki hou ka uhane o Pumaia i ka wahine. Eia nae ke kumu i hiki ai. Nana aku la ka makuahine i ke kaikamahine a pane aku: “U, o kaua ka hoi ka mea aloha o ka iwi koko, aole o ko makuakane o ka iwi koko ole.” I mai la o Pumaia: “Heaha ka olua e hamumu nei?” “Aole, e mea wale ae ana no maua i ka make, aole ou o ka iwi koko ole.” I aku la o Pumaia i ka wahine: “E hele kakou; e wehe ia’u a lawe pu.” Pii aku la lakou mai Pukoula aku a ka uakee o Pauoa e hele la a hiki i ka wai o Alekoki, ma laila aku a Maemae, pela lakou i pii ai a owakawaka kai ao o ke kakahiaka nui, hiki lakou i Nuuanu.",
  "reference_translation": "On the second night, the spirit of Pumaia again came to the wife. The reason for this coming was this: The wife that day looked at her daughter and said: “Yes, I am grieving at our fate as our bones still need blood, not your father as his bones have no blood.” At this Pumaia’s spirit asked: “What are you two talking low about?” The wife replied: “Nothing, we are just talking about death, not of you of the bloodless bones.” Pumaia’s spirit then spoke to the wife: “Let us get away from this place. Take me out and take me along.” After the body had been dug up, they left Pukoula and walked toward the mountains along the road leading to the junction of Pauoa and the road that leads to the Alekoki pool. They then continued on up toward Maemae, and by dawn of [the next day] they reached Nuuanu.",
  "qwq-32b-awq-maui_translation": "<translation>\nIn the depth of darkness, the spirit of Pumaia returns to the woman. Here is the reason why it happened. The mother spoke to her daughter and said: “Oh, our return is because we are of the beloved bloodline, not your father’s bloodline, which is not of blood.” Then Pumaia asked: “What are you two arguing about?” “No,” the woman replied, “it is just that we will die; you are not of the bloodless line.” Pumaia then said to the woman: “Let’s go; separate me and take me along.” They went down from Pukoula and the valley of Pauoa, proceeding toward the waters of Alekoki, then to Maemae, following the path to the dawn tide of the great morning, and arrived at Nuʻuanu.\n</translation>"
}